---
kind: method
id: M:Autodesk.Revit.DB.ViewPlan.GetUnderlayOrientation
zh: 平面视图、平面图
source: html/a96c35ab-13e0-33e1-e0d9-a362575997ea.htm
---
# Autodesk.Revit.DB.ViewPlan.GetUnderlayOrientation Method

**中文**: 平面视图、平面图

Returns the underlay orientation of this view.

## Syntax (C#)
```csharp
public UnderlayOrientation GetUnderlayOrientation()
```

## Returns
The underlay orientation for this view.